{"pageProps":{"postMetadata":{"title":"The Power of Metaphors- data is the new oil.","description":"Metaphors are powerful tools that not only communicate complex ideas.","imgName":"power-of-metaphors/data-is-the-new-oil.jpeg","date":"Feb 27, 2023","tags":["Data","Metaphors","Privacy","Deepfakes","ML","AI"],"keywords":["AI","ML","Data","Metaphors","Privacy","Deepfakes"],"id":"power-of-metaphors"},"postContent":{"compiledSource":"\"use strict\";\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = {\n    a: \"a\",\n    em: \"em\",\n    h3: \"h3\",\n    h6: \"h6\",\n    img: \"img\",\n    li: \"li\",\n    p: \"p\",\n    strong: \"strong\",\n    ul: \"ul\",\n    ..._provideComponents(),\n    ...props.components\n  };\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: _jsx(_components.img, {\n        src: \"power-of-metaphors/data-is-the-new-oil.jpeg\",\n        alt: \"\\\"Power of Metaphors\\\"\"\n      })\n    }), \"\\n\", _jsxs(_components.h6, {\n      id: \"published-on-feb-27-2023\",\n      children: [\"Published on: \", _jsx(_components.strong, {\n        children: \"Feb 27, 2023\"\n      })]\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"introduction\",\n      children: \"Introduction\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.em, {\n        children: \"Metaphors\"\n      }), \" are powerful tools that not only communicate complex ideas but also shape our understanding and actions. In the domain of data/artificial intelligence (AI), the metaphor \\\"Data is the new oil\\\" has profoundly influenced how we perceive and handle data. This article explores the implications of this metaphor and its impact on AI development, data collection practices, and privacy concerns.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"the-rise-of-data-in-ai\",\n      children: \"The Rise of Data in AI\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The AI revolution rests on four pillars: Algorithms, Compute, Communication, and Data. Among these, data has emerged as the critical \\\"fuel\\\" propelling AI advancements across various domains. This realization led to the coining of the phrase \\\"data is the new oil,\\\" highlighting its value in the digital age.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"implications-of-the-data-oil-metaphor\",\n      children: \"Implications of the Data-Oil Metaphor\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Just as oil extraction has environmental and geopolitical consequences, data harvesting brings its own set of challenges:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsxs(_components.li, {\n        children: [_jsx(_components.strong, {\n          children: \"Privacy Concerns\"\n        }), \": The drive to collect vast amounts of data has led to privacy infringements. Examples include the Cambridge Analytica scandal involving Facebook (now Meta) and Google's Wi-Fi data collection during Street View mapping.\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [_jsx(_components.strong, {\n          children: \"National Security Risks\"\n        }), \": Advanced AI models can create convincing deepfakes, as demonstrated by videos of Barack Obama and Leonardo DiCaprio. This technology poses potential threats to national security and personal identity.\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [_jsx(_components.strong, {\n          children: \"Ethical Considerations\"\n        }), \": The collection and use of data often occur without proper consent or understanding from individuals. \", _jsx(_components.a, {\n          href: \"https://www.wired.com/story/apple-spotify-audiobook-narrators-ai-contract/\",\n          children: \"Apple's\"\n        }), \" use of audio data from Spotify to train AI, for instance, raised concerns among voice artists about consent and compensation.\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"global-approaches-to-data-collection\",\n      children: \"Global Approaches to Data Collection\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Different regions have adopted varying approaches to data collection and regulation:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsxs(_components.li, {\n        children: [_jsx(_components.strong, {\n          children: \"China\"\n        }), \": As Kai-Fu Lee notes in \\\"AI Super-Powers,\\\" China's tech companies have turned the country into \\\"the Saudi Arabia of data.\\\" Such philosophies fueled and incentivized the data collection by the Chinese tech companies, with an assumption that \\\"\", _jsx(_components.a, {\n          href: \"https://www.scmp.com/abacus/tech/article/3028402/chinese-internet-users-criticize-baidu-ceo-saying-people-china-are\",\n          children: \"..Chinese people are willing to give up data privacy for convenience..\"\n        }), \".However, the introduction of the \", _jsx(_components.a, {\n          href: \"https://www.dataguidance.com/notes/china-data-protection-overview\",\n          children: \"Personal Information \"\n        }), \"Protection Law in 2021 signals a shift towards stronger data protection.\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [_jsx(_components.strong, {\n          children: \"Western Countries\"\n        }), \": Many are implementing stricter data protection laws, such as the GDPR in Europe, to balance innovation with privacy rights.\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [_jsx(_components.strong, {\n          children: \"Future-Oriented Approaches\"\n        }), \": Projects like TONOMOUS in NEOM aims to build \\\"cognitive cities\\\" using primarily consented data, though the specifics of this model remain unclear.\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"the-deepfake-dilemma-when-data-exploitation-meets-national-security\",\n      children: \"The Deepfake Dilemma: When Data Exploitation Meets National Security\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As data becomes increasingly harvested, mined, and siphoned, we face unprecedented challenges that require proactive mitigation strategies. While TV series like \\\"The Capture\\\" and \\\"Black Mirror\\\" have dramatized potential dystopian outcomes, the line between fiction and reality is blurring rapidly.\\nThe emergence of \\\"digital twins\\\" – AI-generated replicas of individuals based on their audio, video, and behavioral data – presents a particularly concerning development. Recent advancements in deepfake technology have produced remarkably convincing forgeries:\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"A synthesized video of former President \", _jsx(_components.a, {\n        href: \"https://www.youtube.com/watch?v=cQ54GDm1eL0\",\n        children: \"Obama\"\n      }), \" demonstrates how AI can manipulate both audio and visual elements to create a highly realistic fake.\\nA deepfake of actor \", _jsx(_components.a, {\n        href: \"https://www.youtube.com/watch?v=17_xLsqny9E\",\n        children: \"Leonardo DiCaprio\"\n      }), \" showcases the technology's ability to transpose one person's likeness onto another's body with startling accuracy.\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"These, data led,  technological advancements have serious implications for national security. For example, the use of data in the digital forensics was crucial in the investigation of the assassination of \", _jsx(_components.a, {\n        href: \"https://www.npr.org/sections/thetwo-way/2010/02/dubai_police_chief_99_sure_mos.html\",\n        children: \"Mahmoud al-Mabhouh\"\n      }), \", in Dubai in 2010. However, such forensic advantages are rapidly being countered by the companies like \", _jsx(_components.a, {\n        href: \"https://www.haaretz.com/israel-news/security-aviation/2022-12-26/ty-article-magazine/.premium/this-dystopian-cyber-firm-could-have-saved-mossad-assassins-from-exposure/00000185-0bc6-d26d-a1b7-dbd739100000\",\n        children: \"Toka\"\n      }), \", potentially enabling bad actors to evade detection.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This arms race between deepfake creation and detection threatens to undermine the reliability of digital evidence. As deepfake technology improves, distinguishing between authentic and fabricated digital content becomes increasingly challenging. This has far-reaching consequences in intelligence gathering, criminal investigations, and international diplomacy.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"To address these challenges, nations must:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Invest in advanced deepfake detection technologies.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Develop robust digital forensics capabilities that can adapt to evolving threats.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Establish international cooperation frameworks to combat the misuse of deepfake technology.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Implement stricter regulations on data collection and usage to limit the raw material available for creating deepfakes.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As we navigate this new landscape, the balance between technological innovation and security becomes increasingly delicate. The exploitation of data for deepfake creation represents not just a technological challenge, but a fundamental threat to the concept of truth in the digital age.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      id: \"conclusion\",\n      children: \"Conclusion\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"The \\\"data is the new oil\\\" metaphor has been instrumental in highlighting the value of data in the AI era. However, as we grapple with the implications of mass data collection and use, we need to evolve our understanding and approach. By considering electric-power sharing/distribution models like in the smart-grid; we need an analogous data sharing model that can potentially create a more equitable and privacy-respecting data ecosystem (that is data-sharing is incentivized).\\nAs we move forward, it's crucial to engage in ongoing discussions about data rights, privacy, and the ethical use of AI. As \", _jsx(_components.a, {\n        href: \"https://www.youtube.com/watch?v=Sqa8Zo2XWc4\",\n        children: \"John Oliver humorously yet poignantly illustrated in his segment on AI\"\n      }), \", these technologies bring both immense potential and significant challenges that society must address.\"]\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsx(MDXLayout, {\n    ...props,\n    children: _jsx(_createMdxContent, {\n      ...props\n    })\n  }) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"id":"power-of-metaphors"},"__N_SSG":true}